In [1]:
import pandas as pd
from io import StringIO

In [3]:
data=('col1,col2,col3\n'
     'x,y,1\n'
     'a,b,2\n'
      'c,d,3\n')

In [4]:
type(data)

str

In [12]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [6]:
df1=pd.read_json('/Users/admin/data.json')
df1

                                              people
0  {'name': 'John', 'phone': '123-234-5678', 'ema...
1  {'name': 'John Doe', 'phone': '123-234-5678', ...

In [5]:
#df2=pd.read_html('https://en.wikipedia.org/wiki/Mobile_country_code',header=0)

df2=pd.read_html('https://en.wikipedia.org/wiki/Mobile_country_code',match="Mobile network codes",header=0)

    df2.head()

In [6]:
df2[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

In [17]:
df2[0]['Mobile country code'].head()

0    289
1    412
2    276
3    603
4    544
Name: Mobile country code, dtype: int64

In [20]:
# Descriptive Statistics in Python Pandas
#df2[0]['Mobile country code'].sum()
#count() => Number of non-null observations
#df2[0]['Remarks'].count()
#sum() =>Sum of values
#mean()	Mean of Values
#median()	Median of Values
#mode()	Mode of values
#std()	Standard Deviation of the Values
#min()	Minimum Value
#max()	Maximum Value
#abs()	Absolute Value
#prod()	Product of Values
#cumsum()	Cumulative Sum
#cumprod()	Cumulative Product

5

In [21]:
df2[0]['Mobile country code'].count()

252

In [22]:
#Working with date and time using Pandas
data = pd.date_range('1/1/2019', periods = 10,freq='D') 

# for more freq === > https://www.tutorialspoint.com/python_pandas/python_pandas_date_functionality.htm

In [23]:
data

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10'],
              dtype='datetime64[ns]', freq='D')

In [27]:
url = 'http://bit.ly/uforeports'
  
# read csv file 
df3 = pd.read_csv(url)            
df3.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [26]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18216 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  object
dtypes: object(5)
memory usage: 712.7+ KB

In [28]:
# Convert the Time column to datatime format 
#df3['Time'] = pd.to_datetime(df3.Time) 
# convert the 'Date' column to datetime format 
df3['Date'] = df3['Date'].astype('datetime64[ns]')

In [30]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18216 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(4)
memory usage: 712.7+ KB

In [36]:
data=pd.read_excel("/Users/admin/Documents/example.xls",header=None,names=['id','name'])
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      3 non-null      int64
 1   name    3 non-null      object
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [40]:
data1=pd.read_csv("/Users/admin/Documents/user.csv",sep=":")
data1

    id    name  age
0  101    Amit   23
1  102  Deepak   45
2  103     Ram   78
3  104   Shyam   34

In [2]:
s1=pd.Series([2,3,4,8])

In [3]:
s1.max()

8

In [4]:
s1.min()

2